; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-5-10)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 - object)
(:init
(at-robby robot1 room3)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room5)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room4)
(at ball2 room2)
(at ball3 room1)
(at ball4 room1)
(at ball5 room2)
(at ball6 room5)
(at ball7 room4)
(at ball8 room3)
(at ball9 room5)
(at ball10 room1)
)
(:goal
(and
(at ball1 room2)
(at ball2 room1)
(at ball3 room5)
(at ball4 room3)
(at ball5 room4)
(at ball6 room3)
(at ball7 room3)
(at ball8 room1)
(at ball9 room3)
(at ball10 room2)
)
)
)

; plan
1. (pick robot1 ball8 room3 rgripper1)
   deleted: (at ball8 room3) (free robot1 rgripper1)
   added: (carry robot1 ball8 rgripper1)
   goals met: 0 of 10
2. (pick robot2 ball9 room5 lgripper2)
   deleted: (at ball9 room5) (free robot2 lgripper2)
   added: (carry robot2 ball9 lgripper2)
   goals met: 0 of 10
3. (pick robot2 ball6 room5 rgripper2)
   deleted: (at ball6 room5) (free robot2 rgripper2)
   added: (carry robot2 ball6 rgripper2)
   goals met: 0 of 10
4. (move robot1 room3 room1)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room1)
   goals met: 0 of 10
5. (drop robot1 ball8 room1 rgripper1)
   deleted: (carry robot1 ball8 rgripper1)
   added: (at ball8 room1) (free robot1 rgripper1)
   goals met: 1 of 10
6. (pick robot1 ball10 room1 rgripper1)
   deleted: (at ball10 room1) (free robot1 rgripper1)
   added: (carry robot1 ball10 rgripper1)
   goals met: 1 of 10
7. (move robot2 room5 room3)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room3)
   goals met: 1 of 10
8. (drop robot2 ball9 room3 lgripper2)
   deleted: (carry robot2 ball9 lgripper2)
   added: (at ball9 room3) (free robot2 lgripper2)
   goals met: 2 of 10
9. (drop robot2 ball6 room3 rgripper2)
   deleted: (carry robot2 ball6 rgripper2)
   added: (at ball6 room3) (free robot2 rgripper2)
   goals met: 3 of 10
10. (pick robot1 ball3 room1 lgripper1)
   deleted: (at ball3 room1) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 3 of 10
11. (move robot1 room1 room5)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room5)
   goals met: 3 of 10
12. (drop robot1 ball3 room5 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room5) (free robot1 lgripper1)
   goals met: 4 of 10
13. (move robot1 room5 room2)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room2)
   goals met: 4 of 10
14. (drop robot1 ball10 room2 rgripper1)
   deleted: (carry robot1 ball10 rgripper1)
   added: (at ball10 room2) (free robot1 rgripper1)
   goals met: 5 of 10
15. (pick robot1 ball5 room2 rgripper1)
   deleted: (at ball5 room2) (free robot1 rgripper1)
   added: (carry robot1 ball5 rgripper1)
   goals met: 5 of 10
16. (pick robot1 ball2 room2 lgripper1)
   deleted: (at ball2 room2) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 5 of 10
17. (move robot1 room2 room4)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room4)
   goals met: 5 of 10
18. (drop robot1 ball5 room4 rgripper1)
   deleted: (carry robot1 ball5 rgripper1)
   added: (at ball5 room4) (free robot1 rgripper1)
   goals met: 6 of 10
19. (pick robot1 ball1 room4 rgripper1)
   deleted: (at ball1 room4) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 6 of 10
20. (move robot1 room4 room2)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room2)
   goals met: 6 of 10
21. (drop robot1 ball1 room2 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room2) (free robot1 rgripper1)
   goals met: 7 of 10
22. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 7 of 10
23. (drop robot1 ball2 room1 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room1) (free robot1 lgripper1)
   goals met: 8 of 10
24. (pick robot1 ball4 room1 rgripper1)
   deleted: (at ball4 room1) (free robot1 rgripper1)
   added: (carry robot1 ball4 rgripper1)
   goals met: 8 of 10
25. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 8 of 10
26. (drop robot1 ball4 room3 rgripper1)
   deleted: (carry robot1 ball4 rgripper1)
   added: (at ball4 room3) (free robot1 rgripper1)
   goals met: 9 of 10
27. (move robot1 room3 room4)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room4)
   goals met: 9 of 10
28. (pick robot1 ball7 room4 rgripper1)
   deleted: (at ball7 room4) (free robot1 rgripper1)
   added: (carry robot1 ball7 rgripper1)
   goals met: 9 of 10
29. (move robot1 room4 room3)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room3)
   goals met: 9 of 10
30. (drop robot1 ball7 room3 rgripper1)
   deleted: (carry robot1 ball7 rgripper1)
   added: (at ball7 room3) (free robot1 rgripper1)
   goals met: 10 of 10
